# NAME:Beas Jha
# ROLL: 20
# REGD.NO:2241010079
# SEC:07

### Q1.Convert the list [’100’, ’200’, ’python’, ’300.12’, ’400’] to a Series object than sort it. The output should be [’100’, ’200’, ’300.12’, ’400’, ’python’].

In [6]:
import pandas as pd
l=['100', '200', 'python', '300.12', '400']
x=pd.Series(l)
s=x.sort_values()
print(s)

0       100
1       200
3    300.12
4       400
2    python
dtype: object

### Q2.Write a Pandas program to convert the first column of a DataFrame as a Series.

In [7]:
import pandas as pd
d={'col1':[1,2,3,4],'col2':[5,6,7,8]}
df=pd.DataFrame(d)
print('original Dataframe: \n',df)
col=df.iloc[:,0]
print('1st col of DF converted as Series: \n',col)

original Dataframe:
    col1  col2
0     1     5
1     2     6
2     3     7
3     4     8
1st col of DF converted as Series:
 0    1
1    2
2    3
3    4
Name: col1, dtype: int64

### Q3.Create a data frame containing names of first five presidents of India, and years served by them. Once the data frame is created, add another column containing their home state for the first four presidents.

In [19]:
import pandas as pd
x={'Presidents':['Rajendra Prasad','Sarvepalli Radhakrishnan','Zakir Husain','Varahagiri Venkata Giri','Fakhruddin Ali Ahmed'],
   'Years served':[1962-1950,1967-1962,1969-1967,1974-1969,1977-1974]}
frame=pd.DataFrame(x)
frame

                 Presidents  Years served
0           Rajendra Prasad            12
1  Sarvepalli Radhakrishnan             5
2              Zakir Husain             2
3   Varahagiri Venkata Giri             5
4      Fakhruddin Ali Ahmed             3

In [21]:
home=pd.Series(['Bihar','Tamil Nadu','Uttar Pradesh','Andhra Pradesh'],index=[0,1,2,3])
frame['Home State']=home
frame

                 Presidents  Years served      Home State
0           Rajendra Prasad            12           Bihar
1  Sarvepalli Radhakrishnan             5      Tamil Nadu
2              Zakir Husain             2   Uttar Pradesh
3   Varahagiri Venkata Giri             5  Andhra Pradesh
4      Fakhruddin Ali Ahmed             3             NaN

### Q4.Convert s1=[1,2,3,4,2] and s2=[3,4,5,6] to two series objects. Find elements in s1, which are not present in s2.

In [29]:
import pandas as pd
s1=pd.Series([1,2,3,4,2])
s2=pd.Series([3,4,5,6])
not_present=s1[~s1.isin(s2)]
print('Elements of s1 not present in s2 are: \n', not_present)

Elements of s1 not present in s2 are:
 0    1
1    2
4    2
dtype: int64

### Q5.Write a Pandas program to find the index of the first occurrence of the smallest and largest value of a given series. If the input is [1,1, 3, 7,88, 12, 88, 23, 3, 1, 9, 0], the output should be 0 and 4.

In [5]:
import pandas as pd
d=pd.Series([1,1,3,7,88,12,88,23,3,1,9,0])
print('first occurrence of the smallest and largest value of the series is:')
print(d.min())
print(d.idxmax())

first occurrence of the smallest and largest value of the series is:
0
4

### Q6.Convert L=[’Cry’, ’Apple’, ’Orange’, ’Sky’, ’Banana’] to a pandas series. Create a new series with the elements which has a vowel. Create another series which starts with a vowel.

In [2]:
import pandas as pd
d=pd.Series(['Cry','Apple','Orange','Sky','Banana'])
vowel=d[d.str.lower().str.contains('[aeiou]')]
print('Series which has vowel: \n',vowel)
start_vowel=d[d.str.lower().str.startswith(('a','e','i','o','u'))]
print('Series which starts with vowel: \n',start_vowel)

Series which has vowel:
 1     Apple
2    Orange
4    Banana
dtype: object
Series which starts with vowel:
 1     Apple
2    Orange
dtype: object

### Q7.Write a Pandas program to calculate the number of characters in each word in a given series.

In [3]:
L=pd.Series(['Cry', 'Apple', 'Orange', 'Sky', 'Banana'])
length=L.str.len()
df=pd.DataFrame({'words':L,'length':length})
df

    words  length
0     Cry       3
1   Apple       5
2  Orange       6
3     Sky       3
4  Banana       6

### Q8.Create a 4*4 data frame where each entry is from the standard normal distribution. Create another matrix which is element wise square root of the previous matrix. Find the number of NaN values in each column. Find the mean and standard deviation of each column.

In [12]:
a=np.random.randn(4,4)
sqrt=np.sqrt(a)
d=pd.DataFrame(sqrt,columns=['col1','col2','col3','col4'])
print('Square root of original matrix is: \n',sqrt)
nan= d.isna().sum(axis=0)
print('Number of NaN Values \n',nan)
mean=d.mean(axis=0)
print('Mean of the column \n',mean)
std=d.std(axis=0)
print('Standard deviation of column \n',std)

Square root of original matrix is:
 [[       nan 1.22549154 0.55674187        nan]
 [0.60310397        nan 1.41659299        nan]
 [       nan 1.04503413 1.1541244         nan]
 [       nan 1.27754593 1.08203418 0.95299793]]
Number of NaN Values
 col1    3
col2    1
col3    0
col4    3
dtype: int64
Mean of the column
 col1    0.603104
col2    1.182691
col3    1.052373
col4    0.952998
dtype: float64
Standard deviation of column
 col1         NaN
col2    0.122022
col3    0.360342
col4         NaN
dtype: float64

C:\Users\beasj\AppData\Local\Temp\ipykernel_16712\2299534491.py:2: RuntimeWarning: invalid value encountered in sqrt
  sqrt=np.sqrt(a)

### 9. Create a 4*4 matrix, where each row contains Student’s name, registration no, sec and cgpa. D=’Name’:[’A’,”B”,”C”,”D”],’Reg no’:[1,2,3,4], ’Sec’:[’i’,’ii’,’iii’,’iv’],’CGPA’:[7,8,9,10] Find the name, registration no of the student with highest cgpa.(Use np.max on cgpa column) What is the row and column number of the cell with the highest CGPA? (Convert dataframe to numpy array and see which indices has maximum value)

In [71]:
import pandas as pd
import numpy as np
df=pd.DataFrame({'Name':['A','B','C','D'],'Reg no':[1,2,3,4],'Sec':['i','ii','iii','iv'],'CGPA':[7,8,9,10]})
a=np.max(df['CGPA'])
print(a)
df.loc[df['CGPA']>=10]

10

  Name  Reg no Sec  CGPA
3    D       4  iv    10

### Q10.Create a dataframe object, df containing some Nan values. Count the number of missing values in each column of df. Which column has the maximum number of missing values?(create a function to count nan values in a column, use df.apply and that function)

In [14]:
import pandas as pd
df=pd.DataFrame({'A':[1,2,np.nan,4],'B':[5,np.nan,np.nan,8],'C':[9,10,11,12]})
df

     A    B   C
0  1.0  5.0   9
1  2.0  NaN  10
2  NaN  NaN  11
3  4.0  8.0  12

In [19]:
def count_nan(column):
    return column.isna().sum(axis=0)
nan_count_per_column = df.apply(count_nan)
max_nan_column = nan_count_per_column.idxmax()
print("Number of missing values in each column:\n",nan_count_per_column)
print("Column with the maximum number of missing values: \n",max_nan_column)

Number of missing values in each column:
 A    1
B    2
C    0
dtype: int64
Column with the maximum number of missing values:
 B

### Q11.Create a 4*4 matrix, entries from np.arange(16). Reverse the entries of the matrix. The matrix will look like
### [15 14 13 12
###  11 10 9 8
###   7 6 5 4
###   3 2 1 0]

In [63]:
import numpy as np
import pandas as pd
x=np.arange(16)
y=(x[::-1])
y.reshape(4,4)

array([[15, 14, 13, 12],
       [11, 10,  9,  8],
       [ 7,  6,  5,  4],
       [ 3,  2,  1,  0]])

### Q12. Create a 4*4 matrix where each entries are from standard normal distribution. Add a column to this data frame, which contains row wise minimums.

In [64]:
import numpy as np
import pandas as pd
a=pd.DataFrame(np.random.randn(4,4),columns=['col','col2','col3','col4'])
a['rowmin']=a.min(axis=1)
print('Rowise min: \n',a)

Rowise min:
         col      col2      col3      col4    rowmin
0 -2.088849  0.004032  0.943432 -0.190613 -2.088849
1  0.194000  0.408431 -2.298339 -1.113578 -2.298339
2  2.233143 -1.579618 -2.265826  0.639428 -2.265826
3 -0.091476  0.824652  0.664190 -0.504344 -0.504344

### Q13.Create a 4*4 matrix entries from standard normal distribution. Add another row where all entries are NaN. Replace missing values in ’col1’ and ’col2’ columns with their respective mean.

In [47]:
import numpy as np
import pandas as pd
a=np.random.randn(4,4)
row=np.array([np.nan,np.nan,np.nan,np.nan])
a=np.vstack([a,row])
df=pd.DataFrame(a, columns=['col1','col2','col3','col4'])
print('Original DataFrame: \n',df)

Original DataFrame:
        col1      col2      col3      col4
0  0.216883 -1.055876 -0.448906 -1.105835
1  0.785826  1.460466 -3.467270 -1.484610
2 -0.092597 -2.133621  1.047515 -0.218107
3 -1.160500 -0.193780 -0.467356 -0.610092
4       NaN       NaN       NaN       NaN